---
title: MEPBuildingConstructionSet
classe: Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet
namespace: Autodesk.Revit.DB.Mechanical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# MEPBuildingConstructionSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `mEPBuildingConstructionSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `mEPBuildingConstructionSet.Size` | Int32 |
| `Void Clear()` | `mEPBuildingConstructionSet.Clear()` | Void |
| `Boolean Contains(MEPBuildingConstruction)` | `mEPBuildingConstructionSet.Contains(item)` | Boolean |
| `Int32 Erase(MEPBuildingConstruction)` | `mEPBuildingConstructionSet.Erase(item)` | Int32 |
| `MEPBuildingConstructionSetIterator ForwardIterator()` | `mEPBuildingConstructionSet.ForwardIterator()` | MEPBuildingConstructionSetIterator |
| `IEnumerator GetEnumerator()` | `mEPBuildingConstructionSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(MEPBuildingConstruction)` | `mEPBuildingConstructionSet.Insert(item)` | Boolean |
| `MEPBuildingConstructionSetIterator ReverseIterator()` | `mEPBuildingConstructionSet.ReverseIterator()` | MEPBuildingConstructionSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```